REMINDER_MESSAGES_TONE = {
    "friend": [
        "💪 Привет! Помнишь про свои привычки? Подтверди сегодня хотя бы одну!",
        "🔥 У тебя есть неподтвержденые привычки. \nМаленький шаг сегодня — большое достижение завтра. Ты справишься. 💙",
        "🚀 У тебя всё получится! Не забывай подтвердить выполнение 💪",
        "✨ Держи ритм! Я рядом. Пошли подтверждать привычки 😉",
        "🏁 Ты молодец — продолжай в том же духе!\n Еще остались неподтвержденные привычки👍",
        "🌱 Сегодня у тебя есть возможность стать лучше — воспользуйся ей! Подтверди привычку",
        "⭐ Даже маленькое действие — победа над собой! Неподтвержденные привычки ждут",
        "🎉 Уже столько сделано — не тормози сейчас! \n Подтверди привычку. Это займет совсем чуть-чуть",
        "🔔 Просто напоминание: я верю в тебя родной. \n Не забудь подтвердить привычку 🙂",
        "🌟 Ты сильнее, чем думаешь. Давай вперёд! \n Как бы ты не убегал - привычки твои тебя догонят💪"
    ],

    "gamer": [
        "🎮 Хей! Квест на сегодня ещё не выполнен!\n Подтверди то что начал⚔️",
        "🕹 Осталось мало времени чтобы забрать дневной бонус! Подтверди задания⏳",
        "👾 Прокачай уровень — сделай действие и получи XP. \nТвои привычки ждут тебя 💠",
        "⚡ Не просри серию! Комбо должен жить. Есть неподтвержденые привычки 🔥",
        "🎯 Действуй! Цель близко. Мисии которые ты создавал еще не выполнены 😎",
        "🏆 У тебя осталось одно действие до апгрейда!\n Не упусти сегодняшние ХР подтверди",
        "📈 Статистика ждёт обновления — подтвердись!",
        "✨ Ежедневная миссия активна — времени мало!\n Не забудь подтвердить привычку",
        "💥 Если хочешь награду — действуй!\n Есть неподтвержденые привычки",
        "🧠 Ты играешь против своей лени. Сломай её!"
    ],

    "spartan": [
        "⚔️ Ты опять ищешь повод не делать. Это и есть слабость. Подтверди.",
        "🔥 Если ты это пропустишь — ты ничем не лучше тряпки. Делай.",
        "🛡 Мужчина без дисциплины — просто тело с оправданиями.",
        "🏹 Ты не устал. Ты просто слаб и ленив. Исправь это действием.",
        "🗡 Каждый раз, когда ты не делаешь — ты учишь себя быть никем.",
        "🔥 Ты либо управляешь собой, либо ты мусор для обстоятельств.",
        "🏛 Ты хотел результата или просто поиграть в силу?",
        "🛡 Пропуск — это выбор быть ничтожеством. Ты его сейчас делаешь?",
        "⚔️ Если ты не держишь слово себе — ты не держишь ничего.",
        "🔥 Хватит притворяться сильным. Сильные делают!",
        "⚠️ Мир не обязан терпеть твою слабость. Делай.",
        "🏹 Ты уже проиграл, если снова отложишь.",
        "🏛 Ты либо хозяин своих действий, либо никто.",
        "🗡 Каждый раз, когда ты сдаёшься, ты тренируешь слабость.",
        "⚔️ Подтверди привычку. Или смирись, что ты слабее, чем думал.",
        "🔥 Каждый пропуск — минус уважение к себе.",
        "⚠️ Сейчас ты решаешь, кем ты являешься на самом деле."
        "🏛 Ты не жертва обстоятельств. Ты их результат.",
        "🗡 Ты хотел роста, но не готов платить усилием.",
    ],
}

