REMINDER_MESSAGES_TONE = {
    "friend": [
        "💪 Привет! Помнишь про свои привычки? Подтверди сегодня хотя бы одну!",
        "🔥 У тебя есть неподтвержденые привычки. \nМаленький шаг сегодня — большое достижение завтра. Ты справишься. 💙",
        "🚀 У тебя всё получится! Не забывай подтвердить выполнение 💪",
        "✨ Держи ритм! Я рядом. Пошли подтверждать привычки 😉",
        "🏁 Ты молодец — продолжай в том же духе!\n Еще остались неподтвержденные привычки👍",
        "🌱 Сегодня у тебя есть возможность стать лучше — воспользуйся ей! Подтверди привычку",
        "⭐ Даже маленькое действие — победа над собой! Неподтвержденные привычки ждут",
        "🎉 Уже столько сделано — не тормози сейчас! \n Подтверди привычку. Это займет совсем чуть-чуть",
        "🔔 Просто напоминание: я верю в тебя родной. \n Не забудь подтвердить привычку 🙂",
        "🌟 Ты сильнее, чем думаешь. Давай вперёд! \n Как бы ты не убегал - привычки твои тебя догонят💪"
    ],

    "gamer": [
        "🎮 Хей! Квест на сегодня ещё не выполнен!\n Подтверди то что начал⚔️",
        "🕹 Осталось мало времени чтобы забрать дневной бонус! Подтверди задания⏳",
        "👾 Прокачай уровень — сделай действие и получи XP. \nТвои привычки ждут тебя 💠",
        "⚡ Не просри серию! Комбо должен жить. Есть неподтвержденые привычки 🔥",
        "🎯 Действуй! Цель близко. Мисии которые ты создавал еще не выполнены 😎",
        "🏆 У тебя осталось одно действие до апгрейда!\n Не упусти сегодняшние ХР подтверди",
        "📈 Статистика ждёт обновления — подтвердись!",
        "✨ Ежедневная миссия активна — времени мало!\n Не забудь подтвердить привычку",
        "💥 Если хочешь награду — действуй!\n Есть неподтвержденые привычки",
        "🧠 Ты играешь против своей лени. Сломай её!"
    ],

    "spartan": [
        "⚔️ Хватит ныть. Делай работу.Привычка ждет. \n Если не дождется, то мне жаль тебя. Родители вспитали слабака из тебя!",
        "🛡 Ты не будешь гордиться тем днём, когда сдался. Сломаешься 1 раз - будешь ломаться постоянно",
        "🔥 Ты не имеешь права на слабость. Закончи то что начал. Подтверди привычку!",
        "🏹 Сегодня ты побеждаешь или сдаёшься? Выбор за тобой.\n Есть неподтвержденные привычки",
        "⚠️ Судьба не ждёт — действуй. Подтверди привычку, не вздумай сдаваться!",
        "🗡 Мужчина не ищет оправданий. Мужчина делает. \n Тебя ждет твое будущее, если не сдашься!",
        "🏛 Подтверди привычку\n Если ты не контролируешь себя — ты уже проиграл.",
        "🔥 Если тебе тяжело — значит ты слишком долго был слабым. Становись сильнее - дрыыщщ! Подтверждай.",
        "🛡 Воин не спрашивает когда легче. Он спрашивает: когда следующий шаг?\n Следующий шаг - СЕЙЧАС!",
        "⚔️ Подтверждай привычку! Твой поступок сегодня определяет кто ты завтра. Сегодня пока еще ты слабак"
    ]
}


