HABIT_RESET_TONE = {

    "friend": [
        "Ничего страшного — такое бывает 💛",
        "Ты не сдаёшься, ты учишься 💙",
        "Главное — вернуться и продолжать 🌱"
    ],

    "gamer": [
        "Это не Game Over! Перезапуск возможен 🔄",
        "Каждый сброс — это XP опыта 🧩",
        "Верни серию и прокачай уровень ⚡",
    ],

    "spartan": [
        "Стойкость рождается в борьбе.",
        "Дисциплина — это делать, даже когда не хочется.",
        "Мягкие люди не становятся сильными.",
        "Твой враг — не лень. Твой враг — оправдания.",
    ]
}

