# services/habit_create_service.py

from repositories.habit_repository import insert_habit

# =====================================================
# 🔹 Сервис: логика создания пользовательской привычки
#     Получает данные от FSM/handler и передает их в репозиторий.
#     - содержит только бизнес-логику
#     - не работает с базой напрямую
#     - не использует Telegram-объекты
# ====================================================
async def create_custom_habit(user_id: int, data: dict):
    """
    Создаёт пользовательскую привычку.
    
    Аргументы:
        user_id (int): ID пользователя Telegram
        data (dict): данные привычки, сформированные FSM
            {
                "name": str,
                "description": str,
                "days": int,
                "difficulty": int
            }

    Логика:
        - сервис получает данные от хендлера
        - вызывает репозиторий для записи в базу
        - не содержит Telegram кода
        - не содержит SQL
    """

    # insert_habit ничего не возвращает — return тут не нужен
    await insert_habit(
        user_id=user_id,
        name=data["name"],
        desc=data["description"],
        days=data["days"],
        diff=data["difficulty"],
    )
